<img src="http://akhavanpour.ir/notebook/images/srttu.gif" alt="SRTTU" style="width: 150px;"/>

In [1]:
import pandas as pd

In [3]:
df = pd.read_csv('salaries.csv')

In [4]:
df.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,MI,FT,Data Quality Analyst,95000,USD,95000,US,0,US,M
1,2023,MI,FT,Data Quality Analyst,70000,USD,70000,US,0,US,M
2,2023,MI,FT,Data Engineer,258000,USD,258000,US,0,US,M
3,2023,MI,FT,Data Engineer,171000,USD,171000,US,0,US,M
4,2023,SE,FT,Decision Scientist,204500,USD,204500,US,0,US,M

In [8]:
df[df['salary_in_usd']>170000]

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
2,2023,MI,FT,Data Engineer,258000,USD,258000,US,0,US,M
3,2023,MI,FT,Data Engineer,171000,USD,171000,US,0,US,M
4,2023,SE,FT,Decision Scientist,204500,USD,204500,US,0,US,M
9,2020,EX,FT,Managing Director Data Science,300000,USD,300000,US,100,US,L
12,2023,SE,FT,Data Engineer,232960,USD,232960,US,0,US,M
...,...,...,...,...,...,...,...,...,...,...,...
4771,2021,SE,FT,Principal Data Scientist,147000,EUR,173762,DE,100,DE,M
4779,2021,SE,FT,Principal Data Scientist,235000,USD,235000,US,100,US,L
4785,2020,SE,FT,Data Science Manager,190200,USD,190200,US,100,US,M
4792,2021,MI,FT,Applied Machine Learning Scientist,423000,USD,423000,US,50,US,L
4795,2020,SE,FT,Data Scientist,412000,USD,412000,US,100,US,L

In [ ]:
df['Salary']

0     50000
1    120000
2     80000
Name: Salary, dtype: int64

In [ ]:
df[['Name','Age']]

     Name  Age
0    John   34
1   Sally   45
2  Alyssa   27

In [ ]:
df['Age']

0    34
1    45
2    27
Name: Age, dtype: int64

In [ ]:
df['Age'].mean()

35.333333333333336

In [ ]:
df['Age'] > 30

0     True
1     True
2    False
Name: Age, dtype: bool

In [ ]:
age_filter = df['Age'] > 30

In [ ]:
age_filter

0     True
1     True
2    False
Name: Age, dtype: bool

In [ ]:
df[df['Age'] < 30]

     Name  Salary  Age
2  Alyssa   80000   27

In [ ]:
df[df['Age'] > 30]

    Name  Salary  Age
0   John   50000   34
1  Sally  120000   45

<div class="alert alert-block alert-info">
<div style="direction:rtl;text-align:right;font-family:B Lotus, B Nazanin, Tahoma"> دانشگاه تربیت دبیر شهید رجایی<br>کارگاه پایتون<br>علیرضا اخوان پور<br>96-97<br>
</div>
<a href="https://www.srttu.edu/">SRTTU.edu</a> - <a href="http://pylab.akhavanpour.ir">PyLab.AkhavanPour.ir</a> - <a href="http://AkhavanPour.ir">AkhavanPour.ir</a>
</div>